app/Controllers/AdminController.php

    private function prepareAdminDashboardData(): array
    {
        // Get total user counts by role (exclude soft-deleted)
        $usersBuilder = $this->db->table('users');
        $totalUsers = $usersBuilder->where('deleted_at IS NULL')->countAllResults();

        $usersBuilder = $this->db->table('users'); // Reset builder
        $adminCount = $usersBuilder->where('role', 'admin')
                                  ->where('deleted_at IS NULL')
                                  ->countAllResults();
        $usersBuilder = $this->db->table('users'); // Reset builder
        $teacherCount = $usersBuilder->where('role', 'teacher')
                                    ->where('deleted_at IS NULL')
                                    ->countAllResults();
        $usersBuilder = $this->db->table('users'); // Reset builder
        $studentCount = $usersBuilder->where('role', 'student')
                                    ->where('deleted_at IS NULL')
                                    ->countAllResults();

        // Get recent user registrations (last 5 active users)
        $usersBuilder = $this->db->table('users');
        $recentUsers = $usersBuilder->where('deleted_at IS NULL')
                                  ->orderBy('created_at', 'DESC')
                                  ->limit(5)
                                  ->get()
                                  ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'teacher'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
AND `deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5

    private function isLoggedIn(): bool
    {
        if ($this->session->get('isLoggedIn') !== true) {
            return false;
        }

        // Check if session token is still valid (for auto-logout on profile changes)
        $userId = $this->session->get('userID');
        $sessionToken = $this->session->get('sessionToken');

        if ($userId) {
            $usersBuilder = $this->db->table('users');
            $user = $usersBuilder->where('id', $userId)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '10'

    public function manageStudentPrograms()
    {
        // Authorization check for admin role
        if (!$this->isLoggedIn() || $this->session->get('role') !== 'admin') {
            $this->session->setFlashdata('error', 'Access denied. Admin privileges required.');
            return redirect()->to(base_url('login'));
        }

        // Get all students first
        $allStudents = $this->db->table('users')
            ->select('*')
            ->where('role', 'student')
            ->where('deleted_at IS NULL')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();

        $students = [];
        $unenrolledStudents = [];

        // Process each student to get their latest program enrollment
        foreach ($allStudents as $student) {
            $latestEnrollment = $this->db->table('student_programs')
                ->select('student_programs.*, programs.program_code, programs.program_name')
                ->join('programs', 'programs.id = student_programs.program_id', 'left')
                ->where('student_programs.student_id', $student['id'])
                ->orderBy('student_programs.id', 'DESC')
                ->limit(1)
                ->get()
                ->getRowArray();
---
SELECT *
FROM `users`
WHERE `role` = 'student'
AND `deleted_at` IS NULL
ORDER BY `name` ASC
SELECT `student_programs`.*, `programs`.`program_code`, `programs`.`program_name`
FROM `student_programs`
LEFT JOIN `programs` ON `programs`.`id` = `student_programs`.`program_id`
WHERE `student_programs`.`student_id` = '20'
ORDER BY `student_programs`.`id` DESC
 LIMIT 1