app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE   (
`email` = 'daniel@gmail.com'
OR `name` = 'daniel@gmail.com'
 )
 LIMIT 1
---

            // Check the database for a user using email or name (with prepared statements)
            $builder = $this->db->table('users');
            $user = $builder->groupStart()
                               ->where('email', $login)
                               ->orWhere('name', $login)
                           ->groupEnd()
                           ->limit(1)
                           ->get()
                           ->getRowArray();