app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `users`.`id` = 4
---
    public function dashboard()
    {
        $session = session();

        if (! $session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'))->with('login_error', 'Please log in first.');
        }

        $role = strtolower((string) $session->get('role'));
        // Treat generic "user" role as "student" for dashboard purposes
        if ($role === 'user') {
            $role = 'student';
            $session->set('role', 'student');
        }
        $userId = (int) $session->get('userID');
        $userModel = new UserModel();

        // Get user profile
        $data = [
            'profile' => $userModel->find($userId),
            'name' => $session->get('name'),
            'email' => $session->get('email'),
            'role' => $role
        ];