app/Controllers/TeacherController.php

SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `course_id` = '16'
AND `status` = 'confirmed'
---

        // Get enrollment count for each course (only confirmed enrollments)
        foreach ($myCourses as &$course) {
            $enrollmentCount = $this->db->table('enrollments')
                ->where('course_id', $course['id'])
                ->where('status', 'confirmed')
                ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
---

        // Get student count from database
        $studentsBuilder = $this->db->table('users');
        $totalStudents = $studentsBuilder->where('role', 'student')->countAllResults();

SELECT *
FROM `users`
WHERE `id` = '16'
---
    private function isLoggedIn(): bool
    {
        if ($this->session->get('isLoggedIn') !== true) {
            return false;
        }

        // Check if session token is still valid (for auto-logout on profile changes)
        $userId = $this->session->get('userID');
        $sessionToken = $this->session->get('sessionToken');

        if ($userId) {
            $usersBuilder = $this->db->table('users');
            $user = $usersBuilder->where('id', $userId)->get()->getRowArray();