app/Models/CourseModel.php

SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
---
    public function getAllCourses()
    {
        return $this->select('courses.*, users.name as instructor_name')
                    ->join('users', 'users.id = courses.instructor_id', 'left')
                    ->findAll();