app/Models/CourseModel.php

SELECT *
FROM `courses`
WHERE `instructor_id` = '16'
ORDER BY `title` ASC
---
    public function getCoursesByInstructor($instructorId)
    {
        return $this->where('instructor_id', $instructorId)
                    ->orderBy('title', 'ASC')
                    ->findAll();