app/Models/EnrollmentModel.php

SELECT `enrollments`.*, `courses`.*, `enrollments`.`id` as `enrollment_id`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = 4
---
    public function getUserEnrollments($user_id)
    {
        return $this->select('enrollments.*, courses.*, enrollments.id as enrollment_id')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.user_id', $user_id)
                    ->findAll();