app/Models/EnrollmentModel.php

    public function getPendingEnrollmentsByTeacher(int $teacher_id): array
    {
        $builder = $this->db->table($this->table);

        $pending = $builder
            ->select('enrollments.*, users.name as student_name, users.email as student_email, courses.title as course_title, courses.id as course_id')
            ->join('users', 'users.id = enrollments.user_id', 'inner')
            ->join('courses', 'courses.id = enrollments.course_id', 'inner')
            ->where('courses.instructor_id', $teacher_id)
            ->where('enrollments.status', 'pending')
            ->orderBy('enrollments.created_at', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `enrollments`.*, `users`.`name` as `student_name`, `users`.`email` as `student_email`, `courses`.`title` as `course_title`, `courses`.`id` as `course_id`
FROM `enrollments`
INNER JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
INNER JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `courses`.`instructor_id` = 16
AND `enrollments`.`status` = 'pending'
ORDER BY `enrollments`.`created_at` ASC