app/Models/ProgramModel.php

    public function getActivePrograms(): array
    {
        return $this->where('status', 'active')
                   ->orderBy('program_name', 'ASC')
                   ->findAll();
---
SELECT *
FROM `programs`
WHERE `status` = 'active'
ORDER BY `program_name` ASC