app/Models/UserModel.php

SELECT *
FROM `users`
WHERE   (
`email` = 'david.brown@gmail.com'
OR `name` = 'david.brown@gmail.com'
 )
 LIMIT 1
---
    public function findByEmailOrUsername($login)
    {
        return $this->groupStart()
                    ->where('email', $login)
                    ->orWhere('name', $login)
                    ->groupEnd()
                    ->first();